# 算术运算符
# + 加
# - 减
# * 乘
# / 除
# // 取整除
# % 取余
# ** 指数:a**b为a的b次方
# 算术符的优先级  ** => % // / * => + -

print("10/3=", 10 / 3)
print("10//3=", 10 // 3)
print("10.0//3=", 10.0 // 3)
print("10%3=", 10 % 3)
print("10**3=", 10 ** 3)
#
# 输出结果
# 10/3= 3.3333333333333335
# 10//3= 3
# 10.0//3= 3.0
# 10%3= 1
# 10**3= 1000

# 赋值运算符=
# 同时给多个变量赋值
name, age, height = "zs", 10, 20
# 多个变量赋相同的值
a = b = 3

#
# 复合运算符
# +=
# -=
# *=

# 比较运算符:
# ==  判断a是否等于b
# !=  判断a是否不等于b
# >   判断a是否大于b
# <
# >=
# <=

# 逻辑运算符
# and
# or
# not
