'''
1.while循环： else语句可以不加
while 逻辑判断：
    需要执行的逻辑1
else :
    需要执行的逻辑2

2.for循环： else语句可以不加
for num in range(10):
    需要执行的逻辑1
else:
    需要执行的逻辑2

3.range()用法
1.从0到传入的值
range(2):0,1,2
2.从开始值到结束值，每步为1
range(2,5):2,3,4,5
3.从开始值到结束值，每步为step
range(2,10,2):2,4,6,8,10

break:退出循环
continue:退出本次循环
'''

num1 = 1
while num1 <= 10:
    num2 = 1
    while num2 <= num1:
        print(f"{num1}*{num2}={num1 * num2}", end="\t")
        num2 += 1
    print("")
    num1 += 1


print("="*20)

for i in range(2):
    print(i)

print("="*20)

for i in range(2,5):
    print(i)

print("="*20)



for i in range(2,10,2):
    print(i)

"""
输出：
1*1=1	
2*1=2	2*2=4	
3*1=3	3*2=6	3*3=9	
4*1=4	4*2=8	4*3=12	4*4=16	
5*1=5	5*2=10	5*3=15	5*4=20	5*5=25	
6*1=6	6*2=12	6*3=18	6*4=24	6*5=30	6*6=36	
7*1=7	7*2=14	7*3=21	7*4=28	7*5=35	7*6=42	7*7=49	
8*1=8	8*2=16	8*3=24	8*4=32	8*5=40	8*6=48	8*7=56	8*8=64	
9*1=9	9*2=18	9*3=27	9*4=36	9*5=45	9*6=54	9*7=63	9*8=72	9*9=81	
10*1=10	10*2=20	10*3=30	10*4=40	10*5=50	10*6=60	10*7=70	10*8=80	10*9=90	10*10=100	
====================
0
1
====================
2
3
4
====================
2
4
6
8
"""